# 1. Представлен список чисел. Необходимо вывести элементы исходного списка, 
# значения которых больше предыдущего элемента. Use comprehension.
# in
# 9
# out
# [15, 16, 2, 3, 1, 7, 5, 4, 10]
# [16, 3, 7, 10]

# in
# 10
# out
# [28, 20, 10, 5, 1, 24, 7, 15, 23, 25]
# [24, 15, 23, 25]

# list = [28, 20, 10, 5, 1, 24, 7, 15, 23, 25]
# new_list = []
# for i in range(1, len(list)):
#     if list[i] > list[i-1]:
#         new_list.append(list[i])
# print(list)
# print(new_list)
# # ___________________________________________________________________________________________________

# 2. Для чисел в пределах от 20 до N найти числа, кратные 20 или 21. Use comprehension.
# in
# 100
# out
# [20, 21, 40, 42, 60, 63, 80, 84, 100]

# in
# 424
# out
# [20, 21, 40, 42, 60, 63, 80, 84, 100, 105, 120, 126, 140, 147, 160, 168, 180, 189, 200, 210, 220, 231, 240, 252, 260, 273, 280, 294, 300, 315, 320, 336, 340, 357, 360, 378, 380, 399, 400, 420]

# N = int(input("Введите число которое больше 21: "))
# a = 20
# b = 21
# c = a
# d = b
# list = []
# while c <= N:
#     list.append(c)
#     c = c + a
#     if d <= N:
#         list.append(d)
#         d = d + b
# print(list)


# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, 
# ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.

# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

list = {"Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"}
def key_list(list):
    new_list = {}
    for i in sorted(list):
        key = i[0]
        if key not in new_list:
            new_list[key] = [i]
        new_list[key] += [i]
    return new_list
print(key_list(list))